# 함수
# 변수 : 데이터값을 저장하기 위한 공간 (값 재사용/수정 목적)
# 함수 : 코드를 저장하기 위한 공간 (코드 재활용 목적)
# 함수의 특징 : ()가 있다. def를 통해서 만들 수 있다.

# 변수를 생성
이름 = '홍길동'                         # 변수는 데이터만 저장가능

# 함수를 생성
def 홍길동():                           # 함수는 코드를 저장 (print같은것 사용 가능)
    print('안녕하세요 저는 홍길동입니다')
    print('제가 사는곳은 인천이구요')
    print('OO대학교에 다니고 있습니다')

def 임꺽정():
    print('안녕하세요 저는 임꺽정입니다')
    print('제가 사는곳은 서울이구요')
    print('AA대학교에 다니고 있습니다')

def 고양이():
    print('안녕하세요 저는 고양이입니다')
    print('제가 사는곳은 부천이구요')
    print('BB대학교에 다니고 있습니다')

# 변수 사용
이름

# 함수 사용
홍길동()
홍길동()
임꺽정()

