# 처음 만드는것보다 수정(유지보수)하는 것이 더 중요해짐
# 프로그래밍 언어의 발전은 '유지보수'에 초점이 맞춰져있음

# 파이썬 -> python
# 변수 (수학) : x,y,z 변하는 수
# 변수(프로그래밍) : 데이터를 저장하는 공간[저장공간]
공간1 = '파이썬'
공간2 = 321

print(공간1) #변수 사용
print(공간2)

공간3 = 'hello 파이썬!'
공간2 = 111

print(공간2)
print(공간3)

# = (수학) 같다, (프로그래밍) 대입
# = : 오른쪽에 있는 값을 왼쪽 공간에 담는다.
공간1 = 'python'
# 공간1이라는 저장공간에 python을 담는다.

#변수활용 : 자주 바뀔거같은 혹은 자주 사용될 것 같은 값을 미리 저장해놓는다.
과목명 = 'python'
print('안녕 '+과목명+'!')
print('오늘은 '+과목명,'공부 첫 날입니다.')
print('hello '+과목명)
print('안녕 '+과목명+'!')
print('오늘은 '+과목명,'공부 첫 날입니다.')
print('hello '+과목명)
print('안녕 '+과목명+'!')
print('오늘은 '+과목명,'공부 첫 날입니다.')
print('hello '+과목명)
print('안녕 '+과목명+'!')
print('오늘은 '+과목명,'공부 첫 날입니다.')
print('hello '+과목명)
print('안녕 '+과목명+'!')
print('오늘은 '+과목명,'공부 첫 날입니다.')
print('hello '+과목명)
